# TableCellStyleOverrideOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions Constructor
TableCellStyleOverrideOptions Class See Also
---
Creates a new instance with no style characteristics overridden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TableCellStyleOverrideOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TableCellStyleOverrideOptions()
```

# See Also
TableCellStyleOverrideOptions Class
TableCellStyleOverrideOptions Overload
Autodesk.Revit.DB Namespace